In [52]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [55]:
works_custs = pd.read_csv('AdvWorksCusts.csv')

def clean_works_custs_data(works_custs):
    'Function to load the works_custs data set from a .csv file' 
    import pandas as pd
    import numpy as np
    
    ## Recode names
    ## fix column names so the '-' character becomes '_'
    cols = works_custs.columns
    works_custs.columns = [str.replace('-', '_') for str in cols]
    
    ## Treat missing values
    ## Remove rows with missing values, accounting for mising values coded as '?'
    ## cols = ['Occupation']
    ## for column in cols:
    ##    works_custs.loc[works_custs[column] == '?', column] = np.nan
    ## works_custs.dropna(axis = 0, inplace = True)

    ## Transform column data type
    ## Convert some columns to numeric values
    ## for column in cols:
    ##     works_custs[column] = pd.to_numeric(works_custs[column])

    return works_custs
works_custs = clean_works_custs_data(works_custs)

print(works_custs.columns)

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome'],
      dtype='object')

In [56]:
works_custs.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,BirthDate,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome
0,11000,NaN,Jon,V,Yang,NaN,3761 N. 14th St,NaN,Rockhampton,Queensland,...,4/8/66,Bachelors,Professional,M,M,1,0,0,2,137947
1,11001,NaN,Eugene,L,Huang,NaN,2243 W St.,NaN,Seaford,Victoria,...,5/14/65,Bachelors,Professional,M,S,0,1,3,3,101141
2,11002,NaN,Ruben,NaN,Torres,NaN,5844 Linden Land,NaN,Hobart,Tasmania,...,8/12/65,Bachelors,Professional,M,M,1,1,3,3,91945
3,11003,NaN,Christy,NaN,Zhu,NaN,1825 Village Pl.,NaN,North Ryde,New South Wales,...,2/15/68,Bachelors,Professional,F,S,0,1,0,0,86688
4,11004,NaN,Elizabeth,NaN,Johnson,NaN,7553 Harness Circle,NaN,Wollongong,New South Wales,...,8/8/68,Bachelors,Professional,F,S,1,4,5,5,92771

In [57]:
works_custs.dtypes

CustomerID               int64
Title                   object
FirstName               object
MiddleName              object
LastName                object
Suffix                  object
AddressLine1            object
AddressLine2            object
City                    object
StateProvinceName       object
CountryRegionName       object
PostalCode              object
PhoneNumber             object
BirthDate               object
Education               object
Occupation              object
Gender                  object
MaritalStatus           object
HomeOwnerFlag            int64
NumberCarsOwned          int64
NumberChildrenAtHome     int64
TotalChildren            int64
YearlyIncome             int64
dtype: object

In [58]:
works_custs.describe()

,CustomerID,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome
count,16519.000000,16519.000000,16519.000000,16519.000000,16519.000000,16519.000000
mean,20234.225195,0.673891,1.500999,0.992009,2.006235,78122.511532
std,5342.515987,0.468802,1.138962,1.515048,1.682736,39710.985718
min,11000.000000,0.000000,0.000000,0.000000,0.000000,9482.000000
25%,15604.500000,0.000000,1.000000,0.000000,0.000000,47807.500000
50%,20221.000000,1.000000,2.000000,0.000000,2.000000,76120.000000
75%,24860.500000,1.000000,2.000000,2.000000,3.000000,105194.500000
max,29482.000000,1.000000,4.000000,5.000000,5.000000,196511.000000

In [59]:
def count_unique(works_custs, cols):
    for col in cols:
        print('\n' + 'For column ' + col)
        print(works_custs[col].value_counts())

cat_cols = ['BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus', 
            'HomeOwnerFlag', 'YearlyIncome']
count_unique(works_custs, cat_cols)

For column BirthDate
3/18/66     10
5/14/67      9
10/18/73     9
4/2/65       9
2/26/57      9
5/22/60      9
3/13/72      9
12/12/69     8
5/12/64      8
6/24/62      8
6/22/47      8
8/27/65      8
11/7/75      8
9/6/71       8
7/14/64      8
10/9/70      8
10/10/61     8
8/26/57      8
7/8/70       8
7/22/60      8
2/18/66      8
7/4/67       8
3/5/70       8
10/13/58     8
6/15/71      7
4/19/65      7
4/12/59      7
10/10/56     7
10/23/70     7
5/4/64       7
            ..
10/20/67     1
5/26/69      1
10/13/53     1
8/6/58       1
6/19/62      1
10/2/71      1
2/8/73       1
10/18/40     1
10/6/77      1
6/18/41      1
9/7/79       1
9/9/57       1
10/19/68     1
1/25/78      1
12/12/55     1
1/20/76      1
12/4/55      1
9/27/33      1
8/10/66      1
10/26/63     1
9/8/53       1
1/22/58      1
3/13/50      1
3/18/47      1
8/17/58      1
8/11/39      1
10/11/38     1
9/12/78      1
4/23/35      1
8/22/42      1
Name: BirthDate, Length: 7896, dtype: int64

For column Education
Bachelors              4792
Partial College        4484
High School            2968
Graduate Degree        2863
Partial High School    1412
Name: Education, dtype: int64

For column Occupation
Professional      4963
Skilled Manual    4065
Management        2734
Clerical          2619
Manual            2138
Name: Occupation, dtype: int64

For column Gender
M    8351
F    8168
Name: Gender, dtype: int64

For column MaritalStatus
M    8917
S    7602
Name: MaritalStatus, dtype: int64

For column HomeOwnerFlag
1    11132
0     5387
Name: HomeOwnerFlag, dtype: int64

For column YearlyIncome
46333     4
65193     4
97398     4
90448     3
45158     3
65243     3
88674     3
104988    3
92963     3
125879    3
91408     3
45440     3
165819    3
101542    3
88923     3
45434     3
129460    3
82926     3
72663     3
21102     3
11803     3
76220     3
80953     3
46325     3
94610     3
101874    3
53483     3
106128    3
18800     3
46362     3
         ..
109471    1
17314     1
168936    1
33706     1
62436     1
19427     1
83379     1
17068     1
54240     1
24752     1
111580    1
27607     1
97237     1
117715    1
82898     1
74702     1
80845     1
101323    1
27591     1
89025     1
74686     1
99258     1
103352    1
58294     1
129973    1
29620     1
121777    1
152496    1
78764     1
32768     1
Name: YearlyIncome, Length: 15482, dtype: int64